# vim: ft=ruby
brew "atuin" # shell history
brew "bat-extras" # bat extensions
brew "bat" # cat replacement
brew "chezmoi"  # dotfiles manager
brew "cmake" # build tool
brew "coreutils" # GNU coreutils
brew "cosign" # signature tool
brew "curl" # HTTP client
brew "dotslash" # executable runner
brew "duf" # disk usage
brew "dust" # disk usage
brew "eza" # ls replacement
brew "fd" # find replacement
brew "ffmpeg" # media converter
brew "flac" # audio codec
brew "fzf" # fuzzy finder
brew "gh" # GitHub CLI
brew "ghq" # Git repo manager
brew "git-delta" # git diff tool
brew "git-lfs" # Git LFS
brew "git" # version control
brew "gitleaks" # secrets scanner
brew "glow" # markdown viewer
brew "gmp" # math library
brew "jj"  # version control
brew "jq"  # JSON processor
brew "lazygit" # Git TUI
brew "libsodium" # crypto library
brew "mas" # Mac App Store CLI
brew "mermaid-cli" # diagram generator
brew "mise" # tool version manager
brew "neovim" # text editor
brew "node" # Node.js runtime
brew "openssl@3" # crypto library
brew "pipx" # Python installer
brew "readline" # line editing library
brew "ripgrep" # grep replacement
brew "shellcheck" # shell linter
brew "starship" # shell prompt
brew "tesseract" # OCR tool
brew "uv" # Python installer
brew "zoxide" # cd replacement
brew "zsh" # shell
cask "1password-cli" # password CLI
cask "1password" # password manager
cask "cursor" # text editor
cask "ghostty" # terminal emulator
cask "spotify" # music
cask "stats" # system monitor
